# 🚩 यहाँ कठिन शब्दों को सुधारें
SMART_DICT = {
    "knowledge": "नॉलेज",
    "experience": "एक्स-पी-रि-येंस",
    "universe": "यू-नी-वर्स",
    "science": "सांयस",
    "life": "लाइफ",
    "asato": "अस्तो",
    "ma": "मा",
    "sadgamaya": "सद्-ग-म-य",
    "jyotirgamaya": "ज्यों-तिर-ग-म-य"
}

def apply_custom_rules(text):
    # विराम चिह्नों पर हल्का सा ठहराव (सांस लेने के लिए)
    text = text.replace(",", ", ...")
    text = text.replace("।", "। ...")
    text = text.replace(".", ". ...")
    return text
  
